In [40]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//GDP.csv",header=None) #relative path represented as ..
data3.columns=['Date3','GDP']
print(data3.columns)

Index(['Date3', 'GDP'], dtype='object')

In [41]:
#removed the uncessary 0th index row
data3=data3.drop(index=[0])
data3

          Date3        GDP
1    1947-01-01    243.164
2    1947-04-01    245.968
3    1947-07-01    249.585
4    1947-10-01    259.745
5    1948-01-01    265.742
..          ...        ...
307  2023-07-01  27967.697
308  2023-10-01  28296.967
309  2024-01-01  28624.069
310  2024-04-01  29016.714
311  2024-07-01  29374.914

[311 rows x 2 columns]

In [42]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['GDP']=pd.to_numeric(data3['GDP'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

         Date3        GDP
1   1947-01-01    243.164
2   1947-04-01    245.968
3   1947-07-01    249.585
4   1947-10-01    259.745
5   1948-01-01    265.742
..         ...        ...
307 2023-07-01  27967.697
308 2023-10-01  28296.967
309 2024-01-01  28624.069
310 2024-04-01  29016.714
311 2024-07-01  29374.914

[311 rows x 2 columns]

In [43]:
data3['Date3'] = pd.to_datetime(data3['Date3'])
data3=data3.set_index('Date3')
quarterly3=data3.resample('ME').mean() 
quarterly3['GDP'] = quarterly3['GDP'].interpolate(method='time', limit_direction='both')
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3           GDP
0   1947-01-31    243.164000
1   1947-02-28    244.046157
2   1947-03-31    245.022831
3   1947-04-30    245.968000
4   1947-05-31    247.186772
..         ...           ...
926 2024-03-31  28885.832333
927 2024-04-30  29016.714000
928 2024-05-31  29137.411826
929 2024-06-30  29254.216174
930 2024-07-31  29374.914000

[931 rows x 2 columns]

In [44]:
quarterly3.to_csv("GDP.csv", index=False)

In [45]:
quarterly3

         Date3           GDP
0   1947-01-31    243.164000
1   1947-02-28    244.046157
2   1947-03-31    245.022831
3   1947-04-30    245.968000
4   1947-05-31    247.186772
..         ...           ...
926 2024-03-31  28885.832333
927 2024-04-30  29016.714000
928 2024-05-31  29137.411826
929 2024-06-30  29254.216174
930 2024-07-31  29374.914000

[931 rows x 2 columns]